import Image from 'next/image';
import image1 from '@/assets/img/image1.jpg';
import image2 from '@/assets/img/image2.jpg';
import videobg from '@/assets/img/videobg.webp';
import styles from './About.module.scss';

export default function About() {
	return (
		<section id='about' className={`lg:pb-[200px] ${styles.about}`}>
			<div className={styles.about__header}>
				<div className='container'>
					<ul className='lg:pt-[72px] pb-[72px]'>
						<li>Завжди в наявності</li>
						<li>Європейська якість</li>
						<li>Сухий монтаж</li>
						<li>Чистота</li>
						<li>Легкий ремонт</li>
					</ul>
				</div>
			</div>

			<Image src={videobg} alt='videobg' />

			{/* <video
				className={styles.about__video}
				autoPlay
				muted
				loop
				playsInline
				poster='../../../assets/img/videobg.webp'
			>
				<source src='/video/Terraform_G.mp4' type='video/mp4' />
			</video> */}

			<div className='container'>
				<div className={`${styles.about__container} lg:pt-[200px]`}>
					<h2 className='max-w-[410px] min-w-[410px] font-[550] lg:text-[72px] leading-[110%]'>
						Знайдіть <span className={`block text-right`}>різницю</span>
					</h2>
					<p className='max-w-[440px] font-light lg:text-[40px] leading-[110%]'>
						Візуально <b> — преміум.</b> Раціонально <b> — до 45% вигідніше.</b>
					</p>
				</div>
			</div>

			<div className={styles.about__box}>
				<div className={`${styles.about__item1}`}>
					<Image
						src={image1}
						width={570}
						height={470}
						alt='img1'
						className={styles.about__image}
					/>
					<div
						className={`${styles.about__item__block} ${styles.about__item__block_brown} bg-[#231410] text-[#fff6e5]`}
					>
						<div className={styles.about__item__title}>
							<svg
								width='14'
								height='14'
								viewBox='0 0 14 14'
								fill='none'
								xmlns='http://www.w3.org/2000/svg'
							>
								<path d='M9.57513 2.56152L4.37279 2.56152L13.6249 11.8136C13.8651 12.0538 14 12.3796 14 12.7193C14 13.0589 13.8651 13.3847 13.6249 13.6249C13.3847 13.8651 13.0589 14 12.7192 14C12.3795 14 12.0538 13.8651 11.8136 13.6249L2.5615 4.37276L2.5615 9.57513C2.5615 9.9148 2.42656 10.2406 2.18637 10.4808C1.94619 10.7209 1.62042 10.8559 1.28075 10.8559C0.941072 10.8559 0.615309 10.7209 0.375121 10.4808C0.134934 10.2406 4.87155e-08 9.9148 5.27661e-08 9.57513L1.45825e-07 1.77135C0.0214626 0.602917 0.775792 -1.57697e-07 1.76796 -1.45866e-07L9.5751 -5.27664e-08C9.91375 0.00156493 10.238 0.137191 10.4769 0.377211C10.7158 0.61723 10.85 0.942104 10.85 1.28076C10.85 1.61942 10.7158 1.94429 10.4769 2.18431C10.238 2.42433 9.91378 2.55996 9.57513 2.56152Z' />
							</svg>
							Класичний підхід — кілька <br /> преміум-матеріалів і складна реалізація
						</div>
						<p>
							Традиційний проєкт потребує поєднання каменю, дерева та плитки — це
							більше матеріалів, більше процесів і вища фінальна вартість
						</p>
					</div>
				</div>
				<div className={`${styles.about__item2}`}>
					<Image
						src={image2}
						width={570}
						height={470}
						alt='img2'
						className={styles.about__image}
					/>
					<div className={`${styles.about__item__block}`}>
						<div className={styles.about__item__title}>
							<svg
								width='14'
								height='14'
								viewBox='0 0 14 14'
								fill='none'
								xmlns='http://www.w3.org/2000/svg'
							>
								<path d='M9.57513 2.56152L4.37279 2.56152L13.6249 11.8136C13.8651 12.0538 14 12.3796 14 12.7193C14 13.0589 13.8651 13.3847 13.6249 13.6249C13.3847 13.8651 13.0589 14 12.7192 14C12.3795 14 12.0538 13.8651 11.8136 13.6249L2.5615 4.37276L2.5615 9.57513C2.5615 9.9148 2.42656 10.2406 2.18637 10.4808C1.94619 10.7209 1.62042 10.8559 1.28075 10.8559C0.941072 10.8559 0.615309 10.7209 0.375121 10.4808C0.134934 10.2406 4.87155e-08 9.9148 5.27661e-08 9.57513L1.45825e-07 1.77135C0.0214626 0.602917 0.775792 -1.57697e-07 1.76796 -1.45866e-07L9.5751 -5.27664e-08C9.91375 0.00156493 10.238 0.137191 10.4769 0.377211C10.7158 0.61723 10.85 0.942104 10.85 1.28076C10.85 1.61942 10.7158 1.94429 10.4769 2.18431C10.238 2.42433 9.91378 2.55996 9.57513 2.56152Z' />
							</svg>
							Terraform — преміальна естетика з раціональнішою вартістю
						</div>
						<p>
							Terraform працює<b> інакше </b>. Один матеріал бере на себе роль кількох,
							зберігаючи візуальний рівень простору та дозволяючи оптимізувати бюджет
							<b> до 45%</b>
						</p>
					</div>
				</div>
			</div>

			<div className='container'>
				<div className={`${styles.about__footer} pt-[125px]`}>
					<div className={styles.about__footer__desc}>
						Обидва інтер’єри виглядають однаково переконливо: чисті лінії, глибокі
						фактури, цілісний дизайн. Різниця — не у сприйнятті, а в підході до
						реалізації.
					</div>

					<div className={styles.about__footer__container}>
						<div className={styles.about__footer__item}>
							<h3>Стіни</h3>
							<span>Terraform</span>
							<svg
								width='21'
								height='21'
								viewBox='0 0 21 21'
								xmlns='http://www.w3.org/2000/svg'
							>
								<path d='M17.1596 6.63805V14.4424L3.27993 0.562731C2.9196 0.202413 2.4309 -7.69707e-06 1.92132 2.19516e-10C1.41175 7.69751e-06 0.923049 0.202443 0.562731 0.562772C0.202413 0.923101 -7.68633e-06 1.41181 2.18904e-10 1.92138C7.68677e-06 2.43096 0.202443 2.91966 0.562772 3.27997L14.4425 17.1597H6.63805C6.12848 17.1597 5.63978 17.3621 5.27946 17.7224C4.91914 18.0827 4.71671 18.5714 4.71671 19.081C4.71671 19.5906 4.91914 20.0793 5.27946 20.4396C5.63978 20.7999 6.12848 21.0023 6.63805 21.0023H18.345C20.0979 20.9701 21.0023 19.8385 21.0023 18.3501V6.63809C21 6.13005 20.7965 5.64362 20.4365 5.28521C20.0764 4.9268 19.589 4.72559 19.081 4.72559C18.5729 4.72559 18.0856 4.9268 17.7255 5.28521C17.3654 5.64362 17.162 6.13001 17.1596 6.63805Z' />
							</svg>
						</div>

						<div
							className={`${styles.about__footer__item} ${styles.about__footer__item_blue}`}
						>
							<h3>Підлога</h3>
							<span>Terraform</span>
							<svg
								width='21'
								height='21'
								viewBox='0 0 21 21'
								xmlns='http://www.w3.org/2000/svg'
							>
								<path d='M17.1596 6.63805V14.4424L3.27993 0.562731C2.9196 0.202413 2.4309 -7.69707e-06 1.92132 2.19516e-10C1.41175 7.69751e-06 0.923049 0.202443 0.562731 0.562772C0.202413 0.923101 -7.68633e-06 1.41181 2.18904e-10 1.92138C7.68677e-06 2.43096 0.202443 2.91966 0.562772 3.27997L14.4425 17.1597H6.63805C6.12848 17.1597 5.63978 17.3621 5.27946 17.7224C4.91914 18.0827 4.71671 18.5714 4.71671 19.081C4.71671 19.5906 4.91914 20.0793 5.27946 20.4396C5.63978 20.7999 6.12848 21.0023 6.63805 21.0023H18.345C20.0979 20.9701 21.0023 19.8385 21.0023 18.3501V6.63809C21 6.13005 20.7965 5.64362 20.4365 5.28521C20.0764 4.9268 19.589 4.72559 19.081 4.72559C18.5729 4.72559 18.0856 4.9268 17.7255 5.28521C17.3654 5.64362 17.162 6.13001 17.1596 6.63805Z' />
							</svg>
						</div>
					</div>
				</div>
			</div>
		</section>
	);
}
